# SetCurtainWallCutPl

## Description
Sets the curtain wall cut plane of the wall.

```pascal
PROCEDURE SetCurtainWallCutPl(
				wall                : HANDLE;
				curtainWallCutPlane : REAL);
```

```python

def vs.SetCurtainWallCutPl(wall, curtainWallCutPlane):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|wall|HANDLE|The wall.|
|curtainWallCutPlane|REAL|The curtain wall cut plane of the wall.|

## See Also
VS Functions:
GetCurtainWallCutPl

## Version
Availability: from Vectorworks 2016
## Category
* Objects - Walls